# -*- coding:utf-8 -*-


import execjs,requests,time,csv


js_data = '''
function en(t, e) {
for (var n = t.split(""), i = e.split(""), a = {},
r = [], o = 0; o < n.length / 2; o++) a[n[o]] = n[n.length / 2 + o];
for (var s = 0; s < e.length; s++) r.push(a[i[s]]);
return r.join("")
}
'''



header = {
    'Accept': 'application/json, text/plain, */*',
    'Accept-Encoding': 'gzip, deflate',
    'Accept-Language': 'zh-CN,zh;q=0.9',
    # 'Connection': 'keep-alive',
    'Cookie': 'PSTM=1571066865; BIDUPSID=48F5B24960F500CF12D3DB691E9A8CAD; H_WISE_SIDS=139416_136722_114550_139688_137936_139405_138893_128066_139148_120149_138669_138470_138960_133994_138878_137979_137690_131247_132551_118892_118866_118857_118834_118792_138165_107320_138883_136431_139163_139284_139297_136862_138147_138114_139170_139592_136195_137105_139273_139399_139691_133847_137734_138343_137467_138564_134047_131423_139397_139253_139247_137815_139098_136413_110085_127969_139717_139160_138839_137252_138805_128201_138312_137187_136635_139733_138943_139221_138911; BAIDUID=474C75B34F234427AEA62383E7BAB21C:FG=1; bdshare_firstime=1583422279779; BDORZ=B490B5EBF6F3CD402E515D22BCDA1598; delPer=0; PSINO=2; BCLID=7042520569271589750; BDSFRCVID=EyKsJeCCxG3HT8Ju9q-ZE66xHkCH6AQX2liC3J; H_BDCLCKID_SF=tJIJoK_hfIK3fP36q4jqMJFtKh5yhnFXKKOLVbrL3p7keq8CD6jSDtFw-loHalbXbg-HX4nGabovOIQ2y5jHyj-J0nJptUv--RI8_pbgfnnpsIJMQbAWbT8U5fKDKxTuaKviahoEBMb1DljDBT5h2M4qMxtOLR3pWDTm_q5TtUJMeCnTDMFhe6jbja8OtjKJf5vfL5rL2nTVHtoG-tT8Mt_Hqxby26ndf6T9aJ5nJDoVsqTbBp5hK4FVyqO7JJcO52jaW-oFQpP-HJAGQMjT2qDJ2qoIWJvfJHcDKl0MLpnWbb0xynoDK--ihMnMBMnGamOnanrp3fAKftnOM46JehL3346-35543bRTLnLy5KJYMDFlejA2j65bDaRf-b-X-C72sJOOaCvZEJvRy4oTLnk1DP74Lljt-DAe3RngMR-hshO4DJ5kXt6Bj-DeBjIHJbAfoD-2fCvahjruKnboDCCShUFsWPnrB2Q-5KL-b-cbDl5F5jra3UDUQxIjKfjz-55mWMbdJJjofM0l247xhtDrXbnD0MrDJeTxoUJ7MInJhhvG-xI5DqtebPRi3tr9QgbX5lQ7tt5W8ncFbT7l5hKpbt-q0x-jLTnhVn0M5DK0bDPGj5uKjjPW5ptXhJTO2CoMXRj8HJOoDDvMbMOcy4LdjG50LToLWnTtV4jPflvPDCJIDl7MbRLg3-Aq54RPKKrb0DTKBq5V8UoN5UcoQfbQ0MjOqP-jW5IL0U5u5b7JOpvthfnxy-CFQRPH-Rv92DQMVU52QqcqEIQHQT3m5-5bbN3ut6IeJbCt_Ityf-5_jJ7kqtbSMttfqx6betJyaR34XlvbWJ5TEPnjDU7xeMI0eqLLXfLqJjb7BhOdJqjGoKo1Mf-5y6ISKx-_J68OJU5; Hm_lvt_d101ea4d2a5c67dab98251f0b5de24dc=1584770601,1587124647; bdindexid=i97fbkospiu69adn3hiq8d4a17; BDRCVFR[fb3VbsUruOn]=ddONZc2bo5mfAF9pywdpAqVuNqsus; H_PS_PSSID=; BDUSS=zZaWlZZMkh4NEF6WFpoZEpmMk5qNFkxRTg2dFl5ZWZ3WGFMNmpyeWJlMEJWTUZlRVFBQUFBJCQAAAAAAAAAAAEAAAB9nWyHtPPLorj2yPa3tLbUAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHHmV4Bx5lec; CHKFORREG=8eff6f5e9568b3293ec786c4d61d6017; Hm_lpvt_d101ea4d2a5c67dab98251f0b5de24dc=1587136264; RT="z=1&dm=baidu.com&si=91z92805ot9&ss=k94by0ev&sl=4&tt=2p1&bcn=https%3A%2F%2Ffclog.baidu.com%2Flog%2Fweirwood%3Ftype%3Dperf&ld=d7z"',

    'Host': 'index.baidu.com',
    'Referer': 'http://index.baidu.com/v2/main/index.html',
    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.97 Safari/537.36',
    'X-Requested-With': 'XMLHttpRequest'
}


#传入两个参数  返回解密后的数据
#can2 ----0OjKFmN6,fSvkhd,47+.21-5963%08
#can1 ----加密数据
def return_result(can2, can1):

    js = execjs.compile(js_data)
    result = js.call('en', can2, can1)
    return result

words = ['长春经开', '浙江医药', '中再资环', '全柴动力', '南山铝业', '江苏阳光', '海航控股', '太龙药业', '鲁商置业', '天津松江', '瀚叶股份', '圣济堂', 'ST昌九', '城市传媒', '沧州大化', '凌钢股份', '金鹰股份', '圆通速递', 'ST山水', '民丰特纸', '桂冠电力', '铜峰电子', 'ST椰岛', '云南城投', '华业资本', '时代万恒', '中昌数据', '青海华鼎', '万通地产', '成城股份', '延长化建', '两面针', '南纺股份', '冠农股份', '中恒集团', '梦舟股份', '广汇能源', '大湖股份', '首旅酒店', '广晟有色', '凯乐科技', '阳光照明', '北方股份', '景谷林业', '北京城建', '海正药业', '国电南自', '赣粤高速', '航天信息', '开开实业', '嘉化能源', 'ST昌鱼', '恒瑞医药', '亿利洁能', '东方创业', '重庆港九', '中央商场', '太化股份', '南钢股份', '钱江水利', '浦东建设', '羚锐制药', '江苏舜天', '大恒科技', 'ST信通', '华仪电气', '西水股份', '远达环保', '三峡新材', '鄂尔多斯', '广汇汽车', '安琪酵母', '安迪苏', '维维股份', 'ST南化', '标准股份', '曙光股份', '恒顺醋业', '商业城', '酒钢宏兴', '华泰股份', '万华化学', '桂东电力', '荣华实业', '平高电气', '农发种业', '上海家化', '洪都航空', '营口港', '新力金融', '亚星化学', '振华重工', '正源股份', '天房发展', '瀚蓝环境', '华发股份', '西藏天路', '大东方', '兰太实业', '中新药业', '天通股份', '宏达股份', '白云山', '长春燃气', '国机汽车', '澳柯玛', '美克家居', '西藏珠峰', '中油工程', '华夏幸福', '航天动力', '长江通信', '恒力股份', '阳泉煤业', '山东高速', '亚宝药业', '浙江龙盛', '旭光股份', '敦煌种业', '精伦电子', '恒丰纸业', '国旅联合', '新农开发', '华微电子', '华联综超', '江西铜业', '联创光电', '通葡股份', '宁波韵升', '红星发展', '五洲交通', '西南证券', '三房巷', '万向德农', '中航电子', '中文传媒', '华菱星马', '首开股份', '宁沪高速', '天科股份', '宝光股份', '健康元', '青海春天', '广东明珠', '金地集团', '山东金泰', '北巴传媒', '海越能源', '龙净环保', '江山股份', '五矿资本', '航发科技', '盛和资源', '粤泰股份', '盘江股份', '金山股份', 'ST安煤', '海澜之家', 'ST抚钢', '红豆股份', 'ST海润', '大有能源', '动力源', '国电南瑞', 'ST安泰', '三友化工', '华胜天成', '小商品城', '湘电股份', '江淮汽车', '天润乳业', '现代制药', 'ST仰帆', '昆药集团', 'ST柳化', '青松建化', '华鲁恒升', '中远海特', '三元股份', '冠豪高新', '北方导航', '片仔癀', '通威股份', '瑞贝卡', '国机通用', '金证股份', '华纺股份', '宁夏建材', '涪陵电力', '博通股份', '宝钛股份', '时代新材', '贵研铂业', '士兰微', '洪城水业', 'ST九有', '空港股份', '蓝光发展', '好当家', '百利电气', '风神股份', '六国化工', '华光股份', '湘邮科技', '杭萧钢构', '科力远', '千金药业', '凌云股份', '双良节能', '中国动力', '福能股份', '信威集团', '扬农化工', '亨通光电', '天药股份', '中金黄金', '鹏欣资源', '龙元建设', '凤竹纺织', '晋西车轴', '精工钢构', '驰宏锌锗', '烽火通信', '科达洁能', '中化国际', '航天晨光', '安徽水利', '华丽家族', '西昌电力', '香梨股份', '方大特钢', '上海能源', '天富能源', '黑牡丹', '国药股份', '腾达建设', '联环药业', '海航基础', '方大炭素', '置信电气', '康美药业', '贵州茅台', '文一科技', '华海药业', '中天科技', '贵航股份', '长园集团', '菲达环保', '江南高纤', '中铁工业', '山东药玻', '交大昂立', '豫光金铅', '宏达矿业', '栖霞建设', '天士力', '中国软件', '亿晶光电', '国发股份', 'ST狮头', '新赛股份', '莫高股份', '卓郎智能', '山煤国际', '山东黄金', '深高速', '厦门钨业', '保变电气', '时代出版', '凯盛科技', '海航创新', 'ST慧球', '康缘药业', '大西洋', '老白干酒', '金自天正', '江西长运', '国睿科技', '法拉电子', '迪马股份', '济川药业', '山鹰纸业', '中珠医疗', '安阳钢铁', '恒生电子', '信雅达', '康恩贝', '惠泉啤酒', '皖江物流', '祥源文化', '精达股份', '京能电力', '天华院', '卧龙电驱', '八一钢铁', '天地科技', '海油工程', '长电科技', '海螺水泥', '金晶科技', '新华医疗', '用友网络', '广东榕泰', '泰豪科技', '龙溪股份', '大连圣亚', '益佰制药', '中孚实业', '新安股份', '光明乳业', '北大荒', '熊猫金控', '青岛啤酒', '方正科技', '云赛智联', '广汇物流', '市北高新', '汇通能源', '绿地控股', 'ST沪科', '金杯汽车', 'ST毅达', '大众交通', '老凤祥', '神奇制药', '鹏起科技', '丰华股份', '金枫酒业', '国新能源', '氯碱化工', '海立股份', '天宸股份', '华鑫股份', '光大嘉宝', '华谊集团', '复旦复华', '申达股份', '新世界', '华建集团', '龙头股份', '浙数文化', 'ST富控', '大众公用', '三爱富', '东方明珠', '新黄浦', '浦东金桥', '号百控股', '万业企业', '申能股份', '爱建集团', '乐山电力', '中源协和', '同达创业', '外高桥', '城投控股', '锦江投资', '飞乐音响', '游久游戏', '申华控股', 'ST中安', '豫园股份', '信达地产', '电子城', '福耀玻璃', '昂立教育', '强生控股', '陆家嘴', '哈药股份', '天地源', '奥瑞德', '太极实业', '尖峰集团', '天目药业', '东阳光科', '川投能源', '中华企业', '交运股份', '航天通信', '四川金顶', '上海凤凰', 'ST上普', '百川能源', '南京新百', '京投发展', '珠江实业', '中船防务', '金龙汽车', 'ST刚泰', '上海石化', '上海三毛', '青岛海尔', '阳煤化工', '亚通股份', '东百集团', '大商股份', '绿庭投资', 'ST岩石', '欧亚集团', '湖南天雁', '均胜电子', 'ST工新', '舍得酒业', '三安光电', '物产中大', '中航资本', '曲江文旅', '彩虹股份', '光明地产', '苏美达', '盛屯矿业', '南宁百货', '南京医药', '金瑞矿业', '文投控股', '凤凰股份', '天津港', '东软集团', '大连热电', '祁连山', '百花村', '金牛化工', '首商股份', '宁波富达', 'ST云维', '华电能源', '鲁北化工', '佳都科技', '重庆百货', '中国高科', '湖南海利', 'ST新梅', '北汽蓝谷', '实达集团', '新华锦', '苏州高新', '中粮糖业', '兰州民百', '辽宁成大', '山西焦化', '华域汽车', '一汽富维', '华远地产', '华银电力', '闻泰科技', '江苏索普', 'ST大控', '上实发展', 'ST藏旅', '江中药业', '海航科技', '东方银星', '锦江股份', '厦门国贸', '浪潮软件', '长江传媒', '红阳能源', '洲际油气', '中航沈飞', '安徽合力', '通策医疗', '中国海防', '中航重机', '园城黄金', 'ST运盛', '宁波富邦', '祥龙电业', '综艺股份', '广誉远', '西藏城投', '汉商集团', '南京熊猫', '东方通信', '新潮能源', 'ST友好', '水井坊', '通宝能源', '辅仁药业', '新钢股份', '鲁信创投', '鲁银投资', '新华百货', '中储股份', '鲁抗医药', '轻纺城', '京能置业', '云煤能源', '宜宾纸业', '保税科技', '国电电力', '钱江生化', '浙大网新', '宁波海运', '天津磁卡', '华新水泥', '福建水泥', '新奥股份', '鹏博士', '悦达投资', 'ST天业', '马钢股份', '山西汾酒', '神马股份', '东方集团', '华北制药', '杭州解百', '厦工股份', '安信信托', 'ST宏盛', '中路股份', '耀皮玻璃', '隧道股份', '津劝业', '上海物贸', '世茂股份', '益民集团', '新华传媒', '兰生股份', '百联股份', '茂业商业', '人民同泰', '香溢融通', '广电网络', '第一医药', '申通地铁', '上海机电', '界龙实业', '海通证券', '上海九百', '四川长虹', '上柴股份', '上工申贝', '丹化科技', '宝信软件', '同济科技', '万里股份', '上海临港', '华东电脑', '海欣股份', '龙建股份', '春兰股份', '航天长峰', '中天能源', '宁波中百', '银座股份', '王府井', '京城股份', '北京城乡', '中航高科', '内蒙华电', '哈投股份', '百大集团', '星湖科技', '通化东宝', '梅雁吉祥', '智慧能源', 'ST厦华', 'ST油服', '中炬高新', '梅花生物', '创业环保', '东方电气', '洛阳玻璃', 'ST嘉陵', '航天电子', '博瑞传播', '亚泰集团', '妙可蓝多', '博闻科技', '杉杉股份', '宏发股份', '国投电力', '伊利股份', '新疆众和', '南京化纤', '中房股份', '秋林集团', '大晟文化', '航发动力', '广日股份', '张江高科', 'ST海投', '厦门空港', '国美通讯', '长江电力', '江苏租赁', '贵州燃气', '无锡银行', '华安证券', '重庆燃气', '江苏银行', '杭州银行', '西安银行', '湖南盐业', '爱柯迪', '广西广电', '重庆建工', '东方证券', '江苏有线', '渤海汽车', '株冶集团', '国投中鲁', '岳阳林纸', '福成股份', '博汇纸业', '内蒙一机', '郴电国际', '中材国际', '恒源煤电', '宝胜股份', '新五丰', '健民集团', '中国电影', '宜华生活', '广安爱众', '北矿科技', '汇鸿集团', '宁波热电', '惠而浦', '建设机械', '淮北矿业', '科达股份', '航民股份', '赤峰黄金', '四创电子', '贵绳股份', '马应龙', '文山电力', '贵广网络', '开滦股份', '九州通', '招商证券', '唐山港', '大同煤业', '晋亿实业', '柳钢股份', '重庆钢铁', '大秦铁路', '金陵饭店', '连云港', '南京银行', '文峰股份', '宝泰隆', '隆基股份', '陕西黑猫', '节能风电', '宁波港', '山东出版', '华钰矿业', '春秋航空', '玉龙股份', '一拖股份', '赛轮轮胎', '中信建投', '中铝国际', '西部黄金', '国芳集团', '中国神华', '中南传媒', '太平洋', '恒立液压', '昊华能源', '中国一重', '四川成渝', '财通证券', '中国国航', '华鼎股份', '三江购物', '中国化学', '海南橡胶', '四方股份', '小康股份', '常熟银行', '博威合金', '工业富联', '深圳燃气', '新城控股', '重庆水务', '天风证券', '三角轮胎', '兴业银行', '西部矿业', '北京银行', '杭齿前进', '中国西电', '中国铁建', '龙江交通', '东兴证券', '江南水务', '上海环境', '东材科技', '国泰君安', '白银有色', '君正集团', '吉鑫科技', '林洋能源', '陕西煤业', '华电重工', '广州港', '上海银行', '环旭电子', '桐昆股份', '广汽集团', '庞大集团', '农业银行', '青岛港', '骆驼股份', '中国平安', '中国人保', '秦港股份', '交通银行', '绿色动力', '广深铁路', '新华保险', '百隆东方', '三六零', '利群股份', '绿城水务', '陕鼓动力', '中原证券', '兴业证券', '怡球资源', '中国中铁', '工商银行', '通用股份', '东风股份', '吉林高速', '大智慧', '东吴证券', 'ST锐电', '九牧王', '三星医疗', '长沙银行', '会稽山', '北辰实业', '上海电影', '中国外运', '鹿港文化', '中国铝业', '中国太保', '长城军工', '上海医药', '中信重工', '中国核建', '明阳智能', '广电电气', '中国中冶', '嘉泽新能', '中国人寿', '长城汽车', '旗滨集团', '平煤股份', '中国建筑', '中国电建', '明泰铝业', '滨化股份', '华泰证券', '拓普集团', '潞安环能', '风范股份', '郑煤机', '际华集团', '上海电气', '中国中车', '力帆股份', '光大证券', '宁波建工', 'ST蓝科', '星宇股份', '中国交建', '皖新传媒', '中海油服', '新华文轩', '光大银行', '美凯龙', '成都银行', '中国石油', '中国科传', '紫金银行', '福莱特', '中远海发', '长飞光纤', '招商轮船', '正泰电器', '浙商证券', '大连港', '中国银河', '海天精工', '江河集团', '中国国旅', '亚星锚链', '中煤能源', '紫金矿业', '南方传媒', '方正证券', '京运通', '新集能源', '中远海控', '凤凰传媒', '吉视传媒', '永辉超市', '建设银行', '中国出版', '苏垦农发', '金钼股份', '中国汽研', '玲珑轮胎', '宝钢包装', '海南矿业', 'ST长油', '中国核电', '中国银行', '中国重工', '南京证券', '大唐发电', '金隅集团', '丰林集团', '贵阳银行', '中信银行', '出版传媒', '人民网', '奥康国际', '宏昌电子', '龙宇燃油', '晶方科技', '联明股份', '花王股份', '喜临门', '北特科技', '万盛股份', '合锻智能', '创力集团', '亚普股份', '弘讯科技', '新宏泰', '中衡设计', '中设集团', '中科曙光', '爱普股份', '山东华鹏', '新通联', '威帝股份', '大豪科技', '石大胜华', '千禾味业', '赛福天', '天鹅股份', '全筑股份', '安德利', '德新交运', '三维股份', '常熟汽饰', '如通股份', '凯众股份', '华立股份', '泛微网络', '新坐标', '美思德', '华脉科技', '广州酒家', '福达合金', '科林电气', '台华新材', '德邦股份', '永吉股份', '倍加洁', '国检集团', '禾望电气', '音飞储存', '振华股份', '海汽集团', '乐惠国际', '和邦生物', '江化微', '圣达生物', '新疆火炬', '大丰实业', '剑桥科技', '天成自控', '先达股份', '宁波精达', '正裕工业', '宏盛股份', '新经典', '森特股份', '长白山', '川仪股份', '汇嘉时代', '横店影视', '芯能科技', '恒银金融', '润达医疗', '东方材料', '康尼机电', '金能科技', '红蜻蜓', '万林物流', '共进股份', '华培动力', '翠微股份', '中材节能', '昭衍新药', '华贸物流', '春风动力', '上海沪工', '碳元科技', '天目湖', '海量数据', '康惠制药', '养元饮品', '拉夏贝尔', '腾龙股份', '上海亚虹', '汇顶科技', '科华控股', '荣晟环保', '福达股份', '渤海轮渡', '莎普爱思', '兰石重装', '德创环保', '圣龙股份', '新泉股份', '金牌厨柜', '皇马科技', '建研院', '上机数控', '华正新材', '海容冷链', '亚邦股份', '网达软件', '汇得科技', '日播时尚', '保隆科技', '迎驾贡酒', '九华旅游', '上海洗霸', '快克股份', '江山欧派', '爱婴室', '日月股份', '贝通信', '济民制药', '恒通股份', '新凤鸣', '菲林格尔', '雪峰科技', '景旺电子', '奥翔药业', '格尔软件', '大参林', '诺邦股份', '浙江仙通', '电魂网络', '药明康德', '合盛硅业', '天龙股份', '松发股份', '海鸥股份', '银都股份', '大业股份', '赛腾股份', '日盈电子', '海天味业', '泰瑞机器', '永新光学', '杭叉集团', '苏盐井神', '华铁科技', '振德医疗', '得邦照明', '旭升股份', '华懋科技', '应流股份', '维力医疗', '金海环境', '梦百合', '福鞍股份', '诚邦股份', '派思股份', '湘油泵', '迪贝电气', '梅轮电梯', '超讯通信', '苏农银行', '我乐家居', '依顿电子', '上海雅仕', '上海天洋', '百达精工', '苏州龙杰', '尚纬股份', '迪生力', '宏辉果蔬', '杰克股份', '浙江鼎力', '四方科技', '安井食品', '文灿股份', '威尔药业', '莱克电气', '华菱精工', '设计总院', '华达科技', '东珠生态', '百傲化学', '傲农生物', '水星家纺', '日出东方', '辰欣药业', '柳药股份', '今世缘', '东方时尚', '亚士创能', '易德龙', '顶点软件', '惠达卫浴', '广东骏亚', '基蛋生物', '元成股份', '亚振家居', '新天然气', '金辰股份', '邦宝益智', '吉翔股份', '信捷电气', '鼎信通讯', '集友股份', '吉比特', '九洲药业', '勘设股份', '风语筑', '振静股份', '科沃斯', '展鹏科技', '恒为科技', '翔港科技', '祥和实业', '韦尔股份', '金石资源', '南都物业', '振江股份', '思维列控', '欧普照明', '淳中科技', '绝味食品', '维格娜丝', '立霸股份', '司太立', '众源新材', '多伦科技', '掌阅科技', '嘉诚国际', '惠发股份', '美诺华', '贵人鸟', '海兴电力', '起步股份', '健盛集团', '中通国脉', '普莱柯', '珍宝岛', '伟明环保', '长久物流', '汇金通', '三星新材', '荣泰健康', '艾艾精工', '捷昌驱动', '苏利股份', '金麒麟', '地素时尚', '高能环境', '口子窖', '康辰药业', '东尼电子', '伯特利', '引力传媒', '广信股份', '永艺股份', '再升科技', '纵横通信', '博天环境', '珀莱雅', '东方电缆', '京华激光', '天创时尚', '禾丰牧业', '诺力股份', '索通发展', '茶花股份', '韩建河山', '君禾股份', '杭电股份', '中曼石油', '科森科技', '清源股份', '利通电子', '拉芳家化', '徕木股份', '南威软件', '镇海股份', '艾迪精密', '海利尔', '畅联股份', '彤程新材', '朗博科技', '泰禾光电', '春光科技', '安图生物', '璞泰来', '苏州科达', '恒林股份', '三祥新材', '康隆达', '亿嘉和', '五洲新春', '天马科技', '灵康药业', '卫信康', '奇精机械', '火炬电子', '华体科技', '今创集团', '晶华新材', '晨丰科技', '龙马环卫', '石英股份', '皖天然气', '至纯科技', '江苏新能', '安记食品', '航天工程', '纽威股份', '宁波水表', '德宏股份', '盛洋科技', '东方环宇', '健友股份', '家家悦', '中源家居', '香飘飘', '七一二', '密尔克卫', '塞力斯', '天域生态', '海利生物', '中广天择', '阿科力', '天安新材', '朗迪集团', '博迈科', '鸣志电器', '龙韵股份', '岱美股份', '仙鹤股份', '三棵树', '泰晶科技', '蔚蓝生物', '大元泵业', '秦安股份', '隆鑫通用', '中马传动', '常青股份', '沃格光电', '永安行', '来伊份', '乾景园林', '威龙股份', '新日股份', '宁波高发', '星光农机', '雅运股份', '联泰环保', '康普顿', '华友钴业', '道森股份', '志邦家居', '瑞斯康达', '福斯特', '歌力思', '豪能股份', '丰山集团', '诚意药业', '原尚股份', '顾家家居', '海峡环保', '曲美家居', '神力股份', '嘉澳环保', '百合花', '华扬联众', '坤彩科技', '柯利达', '洛凯股份', '欧派家居', '四通股份', '安正时尚', '正平股份', '好太太', '华荣股份', '东宏股份', '步长制药', '能科股份', '中公高科', '白云电器', '桃李面包', '飞科电器', '新智认知', '嘉友国际', '鼎胜新材', '太平鸟', '武进不锈', '永悦科技', '南卫股份', '数据港', '金域医学', '老百姓', '吉祥航空', '元祖股份', '城地股份', '新华网', '新澳股份', '春秋电子', '天永智能', '寿仙谷', '长城科技', '好莱客', '晨光文具', '莱绅通灵', '永创智能', '中持股份', '龙蟠科技', '牧高笛', '合诚股份', '佳力图', '苏博特', '合力科技', '金桥信息', '金徽酒', '世运电路', '金鸿顺', '铁流股份', '兴业股份', '亚翔集成', '睿能科技', '博敏电子', '丽岛新材', '三孚股份', '益丰药房', '大千生态', '威派格', '哈森股份', '百利科技', '克来机电', '大理药业', '法兰泰克', '醋化股份', '银龙股份', '中农立华', '正川股份', '国泰集团', '深圳新星', '金诚信', '吉华集团', '恒润股份', '兆易创新', '康德莱', '中电电机', '艾华集团', '麦迪科技', '至正股份', '洛阳钼业', '中新科技', '继峰股份', '方盛制药', '读者传媒']


date_list = ['2019-10-01', '2019-10-02', '2019-10-03', '2019-10-04', '2019-10-05', '2019-10-06', '2019-10-07', '2019-10-08', '2019-10-09', '2019-10-10', '2019-10-11', '2019-10-12', '2019-10-13', '2019-10-14', '2019-10-15', '2019-10-16', '2019-10-17', '2019-10-18', '2019-10-19', '2019-10-20', '2019-10-21', '2019-10-22', '2019-10-23', '2019-10-24', '2019-10-25', '2019-10-26', '2019-10-27', '2019-10-28', '2019-10-29', '2019-10-30', '2019-10-31', '2019-11-01', '2019-11-02', '2019-11-03', '2019-11-04', '2019-11-05', '2019-11-06', '2019-11-07', '2019-11-08', '2019-11-09', '2019-11-10', '2019-11-11', '2019-11-12', '2019-11-13', '2019-11-14', '2019-11-15', '2019-11-16', '2019-11-17', '2019-11-18', '2019-11-19', '2019-11-20', '2019-11-21', '2019-11-22', '2019-11-23', '2019-11-24', '2019-11-25', '2019-11-26', '2019-11-27', '2019-11-28', '2019-11-29', '2019-11-30', '2019-12-01', '2019-12-02', '2019-12-03', '2019-12-04', '2019-12-05', '2019-12-06', '2019-12-07', '2019-12-08', '2019-12-09', '2019-12-10', '2019-12-11', '2019-12-12', '2019-12-13', '2019-12-14', '2019-12-15', '2019-12-16', '2019-12-17', '2019-12-18', '2019-12-19', '2019-12-20', '2019-12-21', '2019-12-22', '2019-12-23', '2019-12-24', '2019-12-25', '2019-12-26', '2019-12-27', '2019-12-28', '2019-12-29', '2019-12-30', '2019-12-31', '2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04', '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08', '2020-01-09', '2020-01-10', '2020-01-11', '2020-01-12', '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16', '2020-01-17', '2020-01-18', '2020-01-19', '2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23', '2020-01-24', '2020-01-25', '2020-01-26', '2020-01-27', '2020-01-28', '2020-01-29', '2020-01-30', '2020-01-31', '2020-02-01', '2020-02-02', '2020-02-03', '2020-02-04', '2020-02-05', '2020-02-06', '2020-02-07', '2020-02-08', '2020-02-09', '2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13', '2020-02-14', '2020-02-15', '2020-02-16', '2020-02-17', '2020-02-18', '2020-02-19', '2020-02-20', '2020-02-21', '2020-02-22', '2020-02-23', '2020-02-24', '2020-02-25', '2020-02-26', '2020-02-27', '2020-02-28', '2020-02-29', '2020-03-01', '2020-03-02', '2020-03-03', '2020-03-04', '2020-03-05', '2020-03-06', '2020-03-07', '2020-03-08', '2020-03-09', '2020-03-10', '2020-03-11', '2020-03-12', '2020-03-13', '2020-03-14', '2020-03-15', '2020-03-16', '2020-03-17', '2020-03-18', '2020-03-19', '2020-03-20', '2020-03-21', '2020-03-22', '2020-03-23', '2020-03-24', '2020-03-25', '2020-03-26', '2020-03-27', '2020-03-28', '2020-03-29', '2020-03-30', '2020-03-31', '2020-04-01', '2020-04-02', '2020-04-03', '2020-04-04', '2020-04-05', '2020-04-06', '2020-04-07', '2020-04-08', '2020-04-09', '2020-04-10']

dic = {
    '2019-10-01':'2020-04-10',
}


url = 'http://index.baidu.com/api/SearchApi/index'

stu1 = ['word','date','all']
out = open('百度指数.csv', 'a', newline='')
csv_write = csv.writer(out, dialect='excel')
# csv_write.writerow(stu1)

for word in words:

    for start_time in dic:
        parms = {
            'area': '0',
            'word': word,
            'startDate': start_time,
            'endDate': dic[start_time]
        }
        res = requests.get(url=url,headers=header,params=parms)
        print(res.json())
        try:
            uniqid = res.json()['data']['uniqid']
        except:
            with open("err.txt","a+",encoding="utf-8")as f:
                f.write(word+"\n")
            print(f'{word}未被收录')
            break

        url2 = f'http://index.baidu.com/Interface/ptbk?uniqid={uniqid}'
        res2 = requests.get(url=url2, headers=header)
        can2 = res2.json()['data']

        can_all = res.json()['data']['userIndexes'][0]['all']['data']
        result_all = return_result(can2, can_all).split(',')
        print(result_all)
        print(type(result_all))
        if result_all == [""]:
            result_all = ['0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0']


        for i in range(0, 193):
            stu2 = []
            stu2.append(word.encode('GBK', 'ignore').decode('GBK'))
            stu2.append(date_list[i].encode('GBK', 'ignore').decode('GBK'))
            stu2.append("\t"+result_all[i])

            csv_write.writerow(stu2)
        print(f'{word}----{start_time}')
        time.sleep(3)